<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PostSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('posts')->insert([
            [
                'post_name' => 'อินเทล เปิดตัว vPro ซีพียูพลัง AI ',
                'post_about' => 'อินเทล เปิดตัว ซีพียู “Core Ultra” และ “Core 14th Gen” เวอร์ชัน vPro ผสานการทำงานของเอไอ ใช้งานภายในองค์กรได้ง่าย ปลอดภัย และประหยัดพลังงานมากขึ้น',
                'post_content' => 'ในงานจัดแสดงเทคโนโลยีเอไอระดับโลก หรือ MWC 2024 บริษัท อินเทล ได้เปิดตัว Core Ultra และ Core 14th Gen ซีพียูกลุ่ม vPro รองรับการทำงานของเอไอ สำหรับใช้งานในองค์กร ธุรกิจขนาดกลางและขนาดย่อม 

                เดวิด เฟิง รองประธานกลุ่ม Client Computing Group บริษัท อินเทล กล่าวว่า แพลตฟอร์ม Intel vPro เวอร์ชันใหม่ มาพร้อมกับโปรเซสเซอร์ Intel Core Ultra มีระบบรักษาความปลอดภัย ระบบบริหารจัดการที่ง่าย ประหยัดพลังงานมากขึ้นกว่าเดิม
                
                ทั้งนี้ ยังรองรับทั้งโน้ตบุ๊ก (Core Ultra) และเดสก์ท็อป (Core 14th Gen) โดยชิปทั้งสองตัวจะถูกนำไปใช้กับตลาดเวิร์คสเตชันระดับล่าง
                
                จุดเด่นของแพลตฟอร์ม Intel vPro 
                Silicon Security Engine แยกส่วนปลอดภัยในฮาร์ดแวร์ เพื่อตรวจสอบความถูกต้องของเฟิร์มแวร์
                Device Discovery ระบบจัดการพีซีที่ใช้เทคโนโลยี Intel Endpoint Management Assistant องค์กรสามารถสอบถามสถานะของพีซีแต่ละเครื่องจากระยะไกลได้
                Device Health ระบบตรวจสอบสถานะการแพตช์ของช่องโหว่ความปลอดภัย โดยร่วมพัฒนากับ บริษัท Eclypsium ผู้เชี่ยวชาญด้านการรักษาความปลอดภัยของฮาร์ดแวร์ และ VMWare Workspace One แพลตฟอร์มบริหารจัดการอุปกรณ์ภายในองค์กร ที่รองรับการใช้งานทั้ง Windows 10 และ Windows 11',

                'post_img' => 'post/Core.webp',
            ],
            [
                'post_name' => 'แบงก์ญี่ปุ่นจ่อใช้ AI วิเคราะห์หุ้น',
                'post_about' => 'กลุ่มแบงก์ญี่ปุ่นกำลังแข่งขันประยุกต์ใช้ AI ในธุรกิจ ตั้งแต่ระบบคอลเซ็นเตอร์ การวิเคราะห์หุ้น รวมไปถึงพัฒนาตู้ ATM ระบบ AI ดึงนวัตกรรมใหม่ดันกำไรโต กุญแจสำคัญทําให้โตเกียวเป็นศูนย์กลางทางการเงินโลก',
                'post_content' => 'สำนักข่าวนิกเคอิ รายงานถึงกลุ่มธนาคารในญี่ปุ่นกําลังแข่งขันกันเพื่อใช้ปัญญาประดิษฐ์ในธุรกิจของตน ตั้งแต่ระบบคอลเซ็นเตอร์และบริการ ATM ไปจนถึงการต่อต้านการฟอกเงินรวมถึงการวิเคราะห์หุ้น หลงจากตั้งเป้าที่จะเพิ่มผลกําไรและยกระดับราคาหุ้น

                มาซาฮิโกะ คาโตะ (Masahiko Kato) ประธานสมาคมธนาคารญี่ปุ่นกล่าวว่า การใช้งาน AI ในหมู่ธนาคารญี่ปุ่นเติบโตอย่างรวดเร็วในปีที่ผ่านมา
                
                จากธนาคารสมาชิกทั้งหมด 111 แห่ง พบว่ามี 40% กําลังใช้หรือเริ่มพิจารณาการใช้ AI โดยธนาคารยังได้ใช้ประโยชน์จากความสามารถของ Generative AI ซึ่งเป็นเทคโนโลยีแชทบอท ChatGPT แบบ free-to-use สามารถผลิตข้อความ เสียง และรูปภาพในระดับความซับซ้อนซึ่งใกล้เคียงความเป็นมนุษย์
                
                ในตอนนี้ธนาคารญี่ปุ่นนำ AI มาใช้งานเฉพาะงานภายใน เช่น การสรุปและแปลเอกสารภายใน และการเขียนโค้ดสำหรับการใช้งานภายใน และกําลังเตรียมที่จะนำไปใช้กับลูกค้าในบริการบางอย่าง เช่น ข้อความอีเมลถึงลูกค้าจะถูกร่างโดย generative AI และเริ่มใช้ AI เพื่อตรวจสอบข้อมูลธุรกรรมจํานวนมากเพื่อตรวจจับกิจกรรมการฟอกเงิน',

                'post_img' => 'post/Bank.webp',
            ],
            [
                'post_name' => 'จับความเคลื่อนไหว Apple กำลังซุ่มทำ AI ของตัวเองอยู่',
                'post_about' => 'ในภาพรวมองค์กรปี 2564 การอภิปรายงบบริษัทประจำปี 2564 มุ่งเน้นไปที่หลักการด้านสิ่งแวดล้อม สังคม และธรรมาภิบาล (ESG) เป็นส่วนใหญ่ โดยมี Blackrock เป็นผู้นำ',
                'post_content' => 'การเคลื่อนไหวนี้ทำให้เห็นบริษัท S&P 500 จำนวนมาก หรือ 156 แห่งที่รวม ESG ไว้ในรายงานผลประกอบการไตรมาส 4 ของพวกเขา ซึ่งส่งสัญญาณถึงความสำคัญของการเคลื่อนไหวและการยอมรับอย่างกว้างขวาง

                อย่างไรก็ตาม เมื่อเราเข้าสู่ผลประกอบการไตรมาสที่ 4 ของปี 2566 การเปลี่ยนแปลงที่เห็นได้ชัดก็เห็นได้ชัด จำนวนบริษัทที่ยังคงมีส่วนร่วมกับหัวข้อ ESG ลดลงอย่างมากเหลือเพียง 9 หัวข้อ ซึ่งบ่งชี้ว่าการจัดลำดับความสำคัญในองค์กรลดลงอย่างมาก
                
                การเปลี่ยนแปลงนี้แม้จะทำให้ผู้สนับสนุนเรื่องความยั่งยืนท้อใจ แต่ก็ได้เปิดกว้างไปสู่วาทกรรมที่โดดเด่นในแวดวงองค์กร : ปัญญาประดิษฐ์ (AI) และการเรียนรู้ของเครื่อง (Machine Learning)
                
                 
                
                ยักษ์ใหญ่แห่งอุตสาหกรรมเช่น Microsoft Google Facebook และ Tesla ได้สร้างความทะเยอทะยานด้าน AI ของตนให้ชัดเจน โดย Nvidia ได้ขยายเชิงกลยุทธ์ในการดำเนินงานด้านเซมิคอนดักเตอร์ 
                
                ท่ามกลางเสียงโห่ร้องทางเทคโนโลยีนี้ Apple ได้ดำเนินตามเส้นทางเชิงกลยุทธ์ที่เงียบกว่าแต่ก็เท่าเทียมกัน โดยมุ่งเน้นไปที่การเข้าซื้อกิจการสตาร์ทอัพด้าน AI และรวบรวมทีมพัฒนา AI โดยเฉพาะ
                
                ทีมนี้ ซึ่งเป็นกลุ่มผู้เชี่ยวชาญ 16 คน เป็นผู้นำในการสร้าง Ajax GPT ซึ่งเป็น AI การสนทนาที่มีข่าวลือว่าจะบดบังความสามารถของรุ่นก่อน เช่น GPT 3.5 แม้ว่าประสิทธิภาพการทำงานที่น่าเบื่อของ Siri จะถูกทำลายด้วยความขัดแย้งภายในและจุดยืนที่ระมัดระวังของ Apple ที่มีต่อ AI บนคลาวด์ แต่ความทะเยอทะยานของบริษัทก็ยังคงไม่มีจุดบอด ',

                'post_img' => 'post/Apple.webp',
            ],
        ]);
    }
}
